###################################################
#20191010[终焉誓约][任务脚本]【好感度任务】【西蒙-陌生】奖励配置(倪祖伟)
#by:倪祖伟
#date:2019-10-10
#论坛链接:http://forum.nderp.99.com/Forum/TopicList-348538.aspx
###################################################
#注释部分
#DELETE FROM `award_acquire` WHERE `award_id` in (2000631,2000632);
#打开注释部分

###################################################
INSERT INTO `award_acquire` (`award_id`, `award_group`, `award_type`, `award_type_id`, `item_num`, `max_get_rate`, `min_get_rate`) VALUES 
(2000631, 1, 1, 3060110, 2, 10000, 0),
(2000631, 1, 1, 204020, 1, 10000, 0),
(2000632, 1, 1, 3060110, 2, 10000, 0),
(2000632, 1, 1, 1, 50, 10000, 0);
