###################################################
#20200430[终焉誓约][任务脚本]】【雾海的危机】前置任务奖励调整(倪祖伟)
#by:倪祖伟
#date:2020-04-30
#论坛链接:http://forum.nderp.99.com/Forum/TopicList-364993.aspx
###################################################
#注释部分

#打开注释部分
DELETE FROM `award_acquire` WHERE `award_id`=2000633;
###################################################
INSERT INTO `award_acquire` (`award_id`, `award_group`, `award_type`, `award_type_id`, `item_num`, `max_get_rate`, `min_get_rate`) VALUES 
(2000633, 1, 1, 120023, 2, 10000, 0),
(2000633, 1, 1, 3030013, 1, 10000, 0),
(2000633, 1, 1, 204030, 1, 10000, 0),
(2000633, 1, 1, 5, 1500, 10000, 0);
