###################################################
#20190912[终焉誓约][任务脚本]【普通副本】【饿狼巢穴】调整(倪祖伟)
#by:倪祖伟
#date:2019-09-12
#论坛链接:http://forum.nderp.99.com/Forum/TopicList-341014.aspx
###################################################
#注释部分
#DELETE FROM `award_acquire` WHERE `award_id`=1000833;
#DELETE FROM `attribute` WHERE `id`>=1000199 AND `id`<=1000202;
#打开注释部分
DELETE FROM `monster` WHERE `id`>=1000199 AND `id`<=1000202;
###################################################
UPDATE `game_map` SET `type`=7, `reward_id`=1000833, `need_ap`=6, `auto`=1 WHERE `id`=3038;

INSERT INTO `award_acquire` (`award_id`, `award_group`, `award_type`, `award_type_id`, `item_num`, `max_get_rate`, `min_get_rate`) VALUES 
(1000833, 1, 1, 4, 5000, 10000, 0),
(1000833, 1, 1, 8, 5000, 10000, 0),
(1000833, 1, 1, 3, 1000, 10000, 0),
(1000833, 1, 1, 5, 100, 10000, 0),
(1000833, 2, 1, 2110001, 4, 3000, 0),
(1000833, 2, 1, 2110001, 5, 7000, 3000),
(1000833, 2, 1, 2110001, 6, 10000, 7000),
(1000833, 3, 1, 3060030, 1, 120, 0),
(1000833, 3, 1, 3030013, 1, 150, 120);

UPDATE `monster_group` SET `fight`=1 WHERE `id`=200233;
UPDATE `monster_group` SET `fight`=1, `reward_id`=0 WHERE `id`=200234;
UPDATE `monster_group` SET `fight`=1 WHERE `id`=200235;
UPDATE `monster_group` SET `fight`=1 WHERE `id`=200236;

insert into attribute(`id`,`life`,`phy_atk`,`mgc_atk`,`phy_def`,`mgc_def`,`life_add`,`phy_atk_add`,`mgc_atk_add`,`phy_def_add`,`mgc_def_add`,`hit_rate`,`dodge_rate`,`critical_rate`,`critical_dmg`,`critical_def`,`parry_rate`,`parry_def`,`hitbreak_rate`,`hitback_xp`,`dmg_add`,`dmg_cut`,`ice_atk`,`fire_atk`,`dark_atk`,`light_atk`,`ice_def`,`fire_def`,`light_def`,`dark_def`) values
('1000199','1300','325','325','130','130','0','0','0','0','0','10000','0','1000','5000','0','0','2000','0','0','0','0','0','0','0','0','0','0','0','0'),
('1000200','2500','340','340','136','136','0','0','0','0','0','10000','0','1000','5000','0','0','2000','0','0','0','0','0','0','0','0','0','0','0','0'),
('1000201','2500','340','340','136','136','0','0','0','0','0','10000','0','1000','5000','0','0','2000','0','0','0','0','0','0','0','0','0','0','0','0'),
('1000202','3500','355','355','142','142','0','0','0','0','0','10000','0','1000','5000','0','0','2000','0','0','0','0','0','0','0','0','0','0','0','0');

insert into monster(`id`,`name`,`attr_type`,`type`,`sex`,`family`,`profession`,`level`,`attr_id`,`special_effects`,`own_skills`,`skill_que`,`skill_vis`,`skill_loop_que`,`skill_que_vis`,`action_id`) values
('1000199','残暴孤熊','0','0','1','1','1','5','1000199','','1005301;1005302','0,0,1;0,0,1','0','0,0,1;0,0,1','0','0'),
('1000200','白眼独狼','0','1','1','1','1','6','1000200','1011;1141','1004401;1004402','0,1,0;1,0,1,0','0','0,1;1,0,1,0,1;0,1,0;1,0,1','0','0'),
('1000201','冰霜巨熊','0','0','1','1','1','6','1000201','','1004901;1004902','0,0,1;0,0,1','0','0,0,1;0,0,1','0','0'),
('1000202','碎魂狼王乌迪尔','0','2','1','1','1','7','1000202','1011;1121','1002601;1002602;1002603','0,1,0,2;1,0,1,2','0','0,1,2;1,0,1,0,2;0,1,1;1,0,1,2','0','0');
