###################################################
#20200604[终焉誓约][任务脚本]时装商城(倪祖伟)
#by:倪祖伟
#date:2020-06-04
#论坛链接:http://forum.nderp.99.com/Forum/TopicList-373031.aspx
###################################################
#注释部分
DELETE FROM `fashion_shop` WHERE `id` in (1,2,3,4);
#打开注释部分
DELETE FROM `fashion_shop` WHERE `id` in (1001,1002,1003,1004);

###################################################
INSERT INTO `fashion_shop` (`id`, `rmb_project_id`, `fashion_id`, `start_time`, `end_time`, `money_type`, `price`) VALUES 
(1, 1001, 10103, 20200101000000, 20201231000000, 999, 3000),
(2, 0, 20103, 20200101000000, 20201231000000, 10, 272),
(3, 0, 30104, 20200101000000, 20201231000000, 10, 392),
(4, 0, 40101, 20200101000000, 20201231000000, 2, 196);
