###################################################
#20191112[终焉誓约][任务脚本]【剧情副本】【黑龙战舰】数值调整(倪祖伟)
#by:倪祖伟
#date:2019-11-12
#论坛链接:http://forum.nderp.99.com/Forum/TopicList-352764.aspx
###################################################
#注释部分

#打开注释部分
DELETE FROM `attribute` WHERE `id` in (1000602,1000603,1000604,1000605,1000606,1000607);
###################################################
UPDATE `monster` SET `level`=51 WHERE `id`=1000602;
UPDATE `monster` SET `level`=51 WHERE `id`=1000603;
UPDATE `monster` SET `level`=52 WHERE `id`=1000604;
UPDATE `monster` SET `level`=52 WHERE `id`=1000605;
UPDATE `monster` SET `level`=52 WHERE `id`=1000606;
UPDATE `monster` SET `level`=52 WHERE `id`=1000607;

UPDATE `monster_group` SET `fight`=6991, `fight_type`=3 WHERE `id`=200412;
UPDATE `monster_group` SET `fight`=6991, `fight_type`=3 WHERE `id`=200413;
UPDATE `monster_group` SET `fight`=6991, `fight_type`=3 WHERE `id`=200458;

insert into attribute(`id`,`life`,`phy_atk`,`mgc_atk`,`phy_def`,`mgc_def`,`life_add`,`phy_atk_add`,`mgc_atk_add`,`phy_def_add`,`mgc_def_add`,`hit_rate`,`dodge_rate`,`critical_rate`,`critical_dmg`,`critical_def`,`parry_rate`,`parry_def`,`hitbreak_rate`,`hitback_xp`,`dmg_add`,`dmg_cut`,`ice_atk`,`fire_atk`,`dark_atk`,`light_atk`,`ice_def`,`fire_def`,`light_def`,`dark_def`) values
('1000602','81159','4099','4099','1639','1639','0','0','0','0','0','10000','500','1000','5000','0','0','3000','0','0','0','0','0','0','0','0','0','0','0','0'),
('1000603','81159','4099','4099','1639','1639','0','0','0','0','0','10000','500','1000','5000','0','0','3000','0','0','0','0','0','0','0','0','0','0','0','0'),
('1000604','140115','4214','4214','1685','1685','0','0','0','0','0','10000','500','1000','5000','0','0','3000','0','0','0','0','0','0','0','0','0','0','0','0'),
('1000605','140115','4214','4214','1685','1685','0','0','0','0','0','10000','500','1000','5000','0','0','3000','0','0','0','0','0','0','0','0','0','0','0','0'),
('1000606','168138','4214','4214','1685','1685','0','0','0','0','0','10000','500','1000','5000','0','0','3000','0','0','0','0','0','0','0','0','0','0','0','0'),
('1000607','140115','4214','4214','1685','1685','0','0','0','0','0','10000','500','1000','5000','0','0','3000','0','0','0','0','0','0','0','0','0','0','0','0');
