###################################################
#20200430[终焉誓约][任务脚本]秘境限时兑换(倪祖伟)
#by:倪祖伟
#date:2020-04-30
#论坛链接:如：http
###################################################
#注释部分
delete from `exchange` where `id` >= 1 and `id` <= 7;
delete from `shop_type_info` where `id` = 9;
#打开注释部分

###################################################
insert into exchange(`id`,`shop_type`,`target_type`,`target_id`,`direct_use`,`target_num`,`limit_times`,`consume1_id`,`consume1_num`,`consume2_id`,`consume2_num`,`consume3_id`,`consume3_num`) values
('1','100','1','120013','0','1','2','1001','500','0','0','0','0'),
('2','100','1','2000054','0','1','50','1001','40','0','0','0','0'),
('3','100','1','2000064','0','1','8','1001','100','0','0','0','0'),
('4','100','1','210000','0','1','0','1001','10','0','0','0','0'),
('5','100','1','201001','1','1','0','1001','10','0','0','0','0'),
('6','100','1','202000','1','1','0','1001','1','0','0','0','0'),
('7','100','1','203000','1','1','0','1001','1','0','0','0','0');

insert into shop_type_info(`id`,`shop_type`,`deblocking_id`,`refresh_time`,`times_type`,`refresh_money`,`money_id`,`ticket_id`,`limit_time_type`,`time_min`,`time_max`) values
('9','100','0','0','0','0','0','0','1','20200331000000','20201231000000');
