###################################################
#20200524[终焉誓约][任务脚本]自律联盟主线第三阶段奖励调整(倪祖伟)
#by:倪祖伟
#date:2020-05-24
#论坛链接:http://forum.nderp.99.com/Forum/TopicList-372685.aspx
###################################################
#注释部分
#DELETE FROM `award_acquire` WHERE `award_id` in (2000799,2000800,2000801);
#打开注释部分

###################################################
INSERT INTO `award_acquire` (`award_id`, `award_group`, `award_type`, `award_type_id`, `item_num`, `max_get_rate`, `min_get_rate`) VALUES 
(2000799, 1, 1, 204030, 1, 10000, 0),
(2000799, 1, 1, 120023, 1, 10000, 0),
(2000800, 1, 1, 2110001, 5, 10000, 0),
(2000800, 1, 1, 204020, 1, 10000, 0),
(2000801, 1, 1, 204020, 1, 10000, 0),
(2000801, 1, 1, 120023, 1, 10000, 0),
(2000801, 1, 1, 5, 2000, 10000, 0);
