###################################################
#20200519[终焉誓约][任务脚本]修复bug-直购礼包显示乱码(倪祖伟)
#by:倪祖伟
#date:2020-05-19
#论坛链接:http://forum.nderp.99.com/Forum/TopicList-364935.aspx
###################################################
#注释部分
#delete from itemtype where `id` in (4004,4014);
#打开注释部分

###################################################
insert into itemtype(`id`,`name`,`sort`,`time_type`,`time_min`,`time_max`,`amount_limit`,`flag`,`price`,`awardid`,`actionid`,`exchangeid`,`exchange_radio`) values
('4004','穹金之本命灵','0','0','0','0','9999','2','10000','0','0','0','0'),
('4014','双子杰米尼','0','0','0','0','9999','2','10000','0','0','0','0');
