###################################################
#20191010[终焉誓约][任务脚本]【好感度任务】【温丽-陌生】配置(倪祖伟)
#by:倪祖伟
#date:2019-10-10
#论坛链接:http://forum.nderp.99.com/Forum/TopicList-348554.aspx
###################################################
#注释部分

#打开注释部分
DELETE FROM `award_acquire` WHERE `award_id` in (2000623,2000624);
###################################################
INSERT INTO `award_acquire` (`award_id`, `award_group`, `award_type`, `award_type_id`, `item_num`, `max_get_rate`, `min_get_rate`) VALUES 
(2000623, 1, 1, 3060210, 2, 10000, 0),
(2000623, 1, 1, 204020, 1, 10000, 0),
(2000624, 1, 1, 3060210, 2, 10000, 0),
(2000624, 1, 1, 1, 50, 10000, 0);
