###################################################
#20200312[终焉誓约][任务脚本]【黄金怪盗】【新版】活动制作-藏宝副本哥布林巢穴(倪祖伟)
#by:倪祖伟
#date:2020-03-12
#论坛链接:http://forum.nderp.99.com/Forum/TopicList-361838.aspx
###################################################
#注释部分
delete from monster_group where `id` = 200841;
delete from monster where `id` = 1001681;
delete from attribute where `id` = 1001681;
delete from npc_group where `id` = 60499;
delete from award_acquire where `award_id` in (1001044,1001045);
#打开注释部分
delete from gen_event where `id` >= 3150025 and `id` <= 3150042;
###################################################
insert into monster_group(`id`,`name`,`fight`,`multi_boss`,`monster`,`money`,`user_exp`,`hero_exp`,`hero_impression`,`exp_ball`,`reward_id`,`action_id`,`max_battle_time`,`battle_check`,`attack_status_id`,`fight_type`) values
('200841','邪恶的哥布林','0','0','1001231','0','0','0','5','0','0','0','600000','0','1','0');

insert into gen_event(`id`,`name`,`mapid`,`event_type`,`event_id`,`path_id`,`flag`,`intask`,`story_id`,`life_time`,`level_id`,`battle_scene`,`position`,`rotation_y`,`scale`) values
('3150025','','3150','2','200841','14','1','0','0','0','0','53','','0','1'),
('3150026','','3150','1','60499','0','1','0','0','0','0','0','-18.76,0.17,-4.93','0','1'),
('3150027','','3150','1','60499','0','1','0','0','0','0','0','-13.41,0.05,11.94','0','1'),
('3150028','','3150','1','60499','0','1','0','0','0','0','0','-31.60,0.13,15.85','0','1'),
('3150029','','3150','1','60499','0','1','0','0','0','0','0','-42.61,0.18,22.76','0','1'),
('3150030','','3150','1','60499','0','1','0','0','0','0','0','-18.90,0.02,29.37','0','1'),
('3150031','','3150','1','60499','0','1','0','0','0','0','0','-59.36,0.02,25.46','0','1'),
('3150032','','3150','1','60499','0','1','0','0','0','0','0','-59.65,0.36,16.64','0','1'),
('3150033','','3150','1','60499','0','1','0','0','0','0','0','-70.97,0.40,10.38','0','1'),
('3150034','','3150','1','60499','0','1','0','0','0','0','0','-66.79,0.40,48.18','0','1'),
('3150035','','3150','4','1128','0','1','0','0','0','0','0','-13.03,0.77,-1.93','0','1'),
('3150036','','3150','4','1128','0','1','0','0','0','0','0','-18.08,0.77,7.551','0','1'),
('3150037','','3150','4','1128','0','1','0','0','0','0','0','-37.61,0.77,14.16','0','1'),
('3150038','','3150','4','1128','0','1','0','0','0','0','0','-50.63,0.77,19.79','0','1'),
('3150039','','3150','4','1128','0','1','0','0','0','0','0','-62.37,0.77,15.21','0','1'),
('3150040','','3150','4','1128','0','1','0','0','0','0','0','-66.46,0.77,19.08','0','1'),
('3150041','','3150','4','1128','0','1','0','0','0','0','0','-75.66,0.77,7.581','0','1'),
('3150042','','3150','4','1128','0','1','0','0','0','0','0','-79.49,0.77,28.53','0','1');


insert into monster(`id`,`name`,`attr_type`,`type`,`sex`,`family`,`profession`,`level`,`attr_id`,`special_effects`,`own_skills`,`skill_que`,`skill_vis`,`skill_loop_que`,`skill_que_vis`,`action_id`) values
('1001681','哈蒙','0','1','1','1','1','0','1001681','','1001201;1001202;1001203','0,2;2,1,0;0,0,1','0','0,2;2,0,1,0;0,1','0','0');
insert into attribute(`id`,`life`,`phy_atk`,`mgc_atk`,`phy_def`,`mgc_def`,`life_add`,`phy_atk_add`,`mgc_atk_add`,`phy_def_add`,`mgc_def_add`,`hit_rate`,`dodge_rate`,`critical_rate`,`critical_dmg`,`critical_def`,`parry_rate`,`parry_def`,`hitbreak_rate`,`hitback_xp`,`dmg_add`,`dmg_cut`,`ice_atk`,`fire_atk`,`dark_atk`,`light_atk`,`ice_def`,`fire_def`,`light_def`,`dark_def`) values
('1001681','10000','1000','1000','400','400','0','0','0','0','0','10000','0','1000','5000','0','500','2000','0','0','0','0','0','0','0','0','0','0','0','0');

INSERT INTO `npc_group` (`id`, `name`, `req_level`) VALUES 
(60499, '财宝', 1);

INSERT INTO `award_acquire` (`award_id`, `award_group`, `award_type`, `award_type_id`, `item_num`, `max_get_rate`, `min_get_rate`) VALUES 
(1001044, 1, 1, 1, 1000, 10000, 0),
(1001045, 1, 1, 1, 10000, 10000, 0);

UPDATE `monster_group` SET `monster`='1001681' WHERE `id`=200761;
UPDATE `monster_group` SET `monster`='1001231' WHERE `id`=200764;
UPDATE `monster` SET `type`=2 WHERE `id`=1001232;
UPDATE `valve` SET `type`=1 WHERE `id`=1128;
