###################################################
#20200530[终焉誓约][任务脚本]【秘境探索】【神迹实验室】数值修改(倪祖伟)
#by:倪祖伟
#date:2020-05-30
#论坛链接:http://forum.nderp.99.com/Forum/TopicList-373465.aspx
###################################################
#注释部分

#打开注释部分
delete from attribute where `id` >= 1001199 and `id` <= 1001201;
###################################################
insert into attribute(`id`,`life`,`phy_atk`,`mgc_atk`,`phy_def`,`mgc_def`,`life_add`,`phy_atk_add`,`mgc_atk_add`,`phy_def_add`,`mgc_def_add`,`hit_rate`,`dodge_rate`,`critical_rate`,`critical_dmg`,`critical_def`,`parry_rate`,`parry_def`,`hitbreak_rate`,`hitback_xp`,`dmg_add`,`dmg_cut`,`ice_atk`,`fire_atk`,`dark_atk`,`light_atk`,`ice_def`,`fire_def`,`light_def`,`dark_def`) values
('1001199','95273','3437','3437','1374','1374','0','0','0','0','0','10000','500','1000','5000','0','0','3000','0','0','0','0','0','0','0','0','0','0','0','0'),
('1001200','72025','3227','3227','1290','1290','0','0','0','0','0','10000','500','1000','5000','0','0','3000','0','0','0','0','0','0','0','0','0','0','0','0'),
('1001201','103934','3437','3437','1374','1374','0','0','0','0','0','10000','0','1000','5000','0','0','3000','0','0','0','0','0','0','0','0','0','0','0','0');
