###################################################
#20200119[终焉誓约][任务脚本]事件监听系统—体力相关事件监听(倪祖伟)
#by:倪祖伟
#date:2020-01-19
#论坛链接:http://forum.nderp.99.com/Forum/TopicList-356669.aspx
###################################################
#注释部分
#DELETE FROM `monitor` WHERE `id`=1056;
#打开注释部分

###################################################
INSERT INTO `monitor` (`id`, `monitor_type`, `type`, `type_id`, `num_type`, `data1`, `data2`, `data3`, `data4`, `mask1`, `mask2`) VALUES 
(1056, 3, 25, 1, 1, 5, 0, 0, 0, 0, 0);
