###################################################
#20200106[终焉誓约][任务脚本]体力系统—副本掉线邮件返还体力功能_V1.00-SQL数据(倪祖伟)
#by:倪祖伟
#date:2020-01-06
#论坛链接:http://forum.nderp.99.com/Forum/TopicList-356555.aspx
###################################################
#注释部分
#DELETE FROM `config` WHERE `id`=176;
#打开注释部分

###################################################
INSERT INTO `config` (`id`, `type`, `type_id`, `data1`, `data2`, `data3`, `data4`, `data5`, `data6`, `data7`, `param1`, `desc`) VALUES 
(176, 7, 4, 1, 0, 0, 0, 0, 0, 0, '', '秘境掉线，邮件返回体力');
