###################################################
#20191009[终焉誓约][任务脚本]【危机黯月城】前置任务（新）--调整优化(倪祖伟)
#by:倪祖伟
#date:2019-10-09
#论坛链接:http://forum.nderp.99.com/Forum/TopicList-345740.aspx
###################################################
#注释部分
#DELETE FROM `award_acquire` WHERE `award_id`=2000633;
#打开注释部分

###################################################
INSERT INTO `award_acquire` (`award_id`, `award_group`, `award_type`, `award_type_id`, `item_num`, `max_get_rate`, `min_get_rate`) VALUES 
(2000633, 1, 1, 3030013, 1, 10000, 0),
(2000633, 1, 1, 1, 500, 10000, 0),
(2000633, 1, 1, 204020, 2, 10000, 0);
