###################################################
#20200604[终焉誓约][任务脚本]战队头像—战队头像获取(倪祖伟)
#by:倪祖伟
#date:2020-06-04
#论坛链接:http://forum.nderp.99.com/Forum/TopicList-370800.aspx
###################################################
#注释部分

#打开注释部分
DELETE FROM `icon_mask` WHERE `id`>=14 AND `id`<=19;
###################################################
INSERT INTO `icon_mask` (`id`, `icon_id`, `icon_type`, `icon_index`, `change_id`, `change_num`, `change_type`, `change_index`) VALUES 
(14, 10101, 11, 1, 1, 100, 16, 1),
(15, 10056, 11, 2, 1, 100, 16, 2),
(16, 10028, 11, 3, 1, 100, 16, 3),
(17, 10103, 11, 4, 1, 100, 16, 4),
(18, 10158, 11, 5, 1, 100, 16, 5),
(19, 10166, 11, 6, 1, 100, 16, 6);
