###################################################
#20200524[终焉誓约][任务脚本]时装商店bug修复(倪祖伟)
#by:倪祖伟
#date:2020-05-24
#论坛链接:http://forum.nderp.99.com/Forum/TopicList-372171.aspx
###################################################
#注释部分
#DELETE FROM `fashion_shop` WHERE `id` in (1002,1003,1004);
#打开注释部分
DELETE FROM `fashion_shop` WHERE `id` in (1,2,3);

###################################################
INSERT INTO `fashion_shop` (`id`, `fashion_id`, `start_time`, `end_time`, `money_type`, `price`) VALUES 
(1002,20103,20200101000000,20201231000000,10,272),
(1003,30104,20200101000000,20201231000000,10,392),
(1004,40101,20200101000000,20201231000000,2,196);
