###################################################
#20191123[终焉誓约][任务脚本]浮士德72临时处理(倪祖伟)
#by:倪祖伟
#date:2019-11-23
#论坛链接:http://forum.nderp.99.com/Forum/TopicList-354111.aspx
###################################################
#注释部分

#打开注释部分
delete from monster where `id` in (1000760,9000432);
###################################################
insert into monster(`id`,`name`,`attr_type`,`type`,`sex`,`family`,`profession`,`level`,`attr_id`,`special_effects`,`own_skills`,`skill_que`,`skill_vis`,`skill_loop_que`,`skill_que_vis`,`action_id`) values
('1000760','浮士德72','0','0','1','7','1','0','1000760','1021','1001601;1001602;1001603','0,1,0,2;1,0,1','0','0,1,0;0,1,0,2;0,1,0;0,1,2;0,1,0','0','0'),
('9000432','浮士德72','0','0','1','7','1','50','9000432','1021','1001601;1001602;1001603','0,1,0,2;1,0,1','0','0,1,0;0,1,0,2;0,1,0;0,1,2;0,1,0','0','0');
