###################################################
#20200430[终焉誓约][任务脚本]【剧情副本】【神迹实验室】数值调整(倪祖伟)
#by:倪祖伟
#date:2020-04-30
#论坛链接:http://forum.nderp.99.com/Forum/TopicList-368742.aspx
###################################################
#注释部分

#打开注释部分
DELETE FROM `award_acquire` WHERE `award_id` = 1000286;
###################################################
INSERT INTO `award_acquire` (`award_id`, `award_group`, `award_type`, `award_type_id`, `item_num`, `max_get_rate`, `min_get_rate`) VALUES 
(1000286, 1, 1, 2120013, 10, 10000, 0),
(1000286, 1, 1, 2110001, 50, 10000, 0),
(1000286, 1, 1, 1, 1000, 10000, 0);
