###################################################
#20190910[终焉誓约][任务脚本]湖畔镇怪物属性调整(倪祖伟)
#by:倪祖伟
#date:2019-09-10
#论坛链接:http://forum.nderp.99.com/Forum/TopicList-346071.aspx
###################################################
#注释部分

#打开注释部分
DELETE FROM `attribute` WHERE `id` in (802201,80310023,80310026);
###################################################
insert into attribute(`id`,`life`,`phy_atk`,`mgc_atk`,`phy_def`,`mgc_def`,`life_add`,`phy_atk_add`,`mgc_atk_add`,`phy_def_add`,`mgc_def_add`,`hit_rate`,`dodge_rate`,`critical_rate`,`critical_dmg`,`critical_def`,`parry_rate`,`parry_def`,`hitbreak_rate`,`hitback_xp`,`dmg_add`,`dmg_cut`,`ice_atk`,`fire_atk`,`dark_atk`,`light_atk`,`ice_def`,`fire_def`,`light_def`,`dark_def`) values
('802201','2650','250','250','0','0','0','0','0','0','0','10000','0','0','0','10000','0','0','0','0','0','0','0','0','0','0','0','0','0','0'),
('80310023','500','1000','1000','0','0','0','0','0','0','0','10000','0','0','5000','10000','0','0','0','0','0','0','0','0','0','0','0','0','0','0'),
('80310026','2700','180','0','0','0','0','0','0','0','0','10000','0','0','0','10000','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
